---
kind: type
id: T:Autodesk.Revit.DB.Electrical.InsulationType
source: html/3eacc872-bb46-73a5-9ae7-d309d1d3ad64.htm
---
# Autodesk.Revit.DB.Electrical.InsulationType

Represents electrical insulation type definition information.

## Syntax (C#)
```csharp
public class InsulationType : ElementType
```

## Remarks
Insulation type is defined based on corresponding wire material type and temperature rating type.